{"config": [{"class_name": "Lambda", "config": {"trainable": true, "output_shape": null, "output_shape_type": "raw", "input_dtype": "float32", "name": "lambda_1", "arguments": {}, "batch_input_shape": [null, 64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa!train_behavioral_cloning_64x64.py\u00da\b<lambda>\u0093\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_filter": 24, "name": "convolution2d_1", "b_constraint": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "nb_col": 5, "W_constraint": null, "nb_row": 5, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_filter": 36, "name": "convolution2d_2", "b_constraint": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "nb_col": 5, "W_constraint": null, "nb_row": 5, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_filter": 48, "name": "convolution2d_3", "b_constraint": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "nb_col": 5, "W_constraint": null, "nb_row": 5, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "name": "convolution2d_4", "b_constraint": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "nb_col": 3, "W_constraint": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "name": "convolution2d_5", "b_constraint": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "nb_col": 3, "W_constraint": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_constraint": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "output_dim": 100, "input_dim": 64, "activation": "linear", "W_constraint": null, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_constraint": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "output_dim": 50, "input_dim": 100, "activation": "linear", "W_constraint": null, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "output_dim": 10, "input_dim": 50, "activation": "linear", "W_constraint": null, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "output_dim": 1, "input_dim": 10, "activation": "linear", "W_constraint": null, "bias": true}}], "class_name": "Sequential", "keras_version": "1.2.1"}